app/controllers/admin/bares_e_boates_controller.rb

SELECT * FROM `bares_e_boates`
---
  def index
    @bares_e_boates = BaresEBoate.all

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 2)
---
  def new
    @col = "col1"
    @estabelecimento = Estabelecimento.find(params[:estabelecimento_id])

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 5)
INSERT INTO `bares_e_boates` (`publico_alvo`, `horario_atendimento`, `created_at`, `updated_at`, `forma_pagamento`, `nome_estabelecimento`, `estabelecimento_id`, `descricao`) VALUES('Lorem Ipsum', 'Lorem Ipsum', '2009-12-26 23:34:10', '2009-12-26 23:34:10', 'Lorem Ipsum', NULL, 5, 'Lorem Ipsum')
---
  def create
    @estabelecimento = Estabelecimento.find(params[:estabelecimento_id])
    @bares_e_boate = @estabelecimento.bares_e_boate.build(params[:bares_e_boate])
    if @bares_e_boate.save

SELECT * FROM `bares_e_boates` WHERE (`bares_e_boates`.`id` = 1)
UPDATE `bares_e_boates` SET `updated_at` = '2009-12-27 21:50:47', `descricao` = 'Lorem ipsum 2', `horario_atendimento` = 'Lorem ipsum 2', `forma_pagamento` = 'Lorem ipsum 2', `publico_alvo` = 'Lorem ipsum 2' WHERE `id` = 1
---
  def update
    @bares_e_boate = BaresEBoate.find(params[:id])
    if @bares_e_boate.update_attributes(params[:bares_e_boate])