app/controllers/admin/clientes_controller.rb

SELECT * FROM `clientes` WHERE (nome_fantasia LIKE '%octagono%' OR razao_social LIKE '%octagono%' OR nome_responsavel LIKE '%octagono%')
---
  def index
    @col = "col2-right"
    if params[:search]
      @clientes = Cliente.search(params[:search])

SELECT * FROM `clientes` WHERE (`clientes`.`id` = 3)
---
  def show
    @col = "col1"
    @cliente = Cliente.find(params[:id])

INSERT INTO `clientes` (`email_responsavel`, `telefone_comercial`, `created_at`, `cep_estabelecimento`, `estado_estabelecimento`, `updated_at`, `cnpj_estabelecimento`, `telefone_responsavel`, `cidade_estabelecimento`, `ramo_atuacao`, `bairro_estabelecimento`, `email_estabelecimento`, `razao_social`, `endereco_estabelecimento`, `numero_estabelecimento`, `complemento_estabelecimento`, `telefone_fax`, `nome_responsavel`, `telefone_celular`, `nome_fantasia`) VALUES('alberto.braschi@gmail.com', '41 3779-0689', '2009-12-25 23:26:43', '80630-000', 'Parana', '2009-12-25 23:26:43', '11.255.477/0001-34', 41, 'Curitiba', 'Web', 'Guaira', 'comercial@octagonoecommerce.com.br', 'A. G. Braschi Des. Sist. Web', 'Paraiba', '2015', 'Casa 2', '', 'Alberto Braschi', '41 8478-4024', 'Octagono Tecnologia')
---
  def create
    @col = "col1"
    @cliente = Cliente.new(params[:cliente])
    if @cliente.save

SELECT * FROM `clientes` WHERE (`clientes`.`id` = 3)
---
  def edit
    @col = "col1"
    @cliente = Cliente.find(params[:id])

SELECT * FROM `clientes` WHERE (`clientes`.`id` = 4)
UPDATE `clientes` SET `updated_at` = '2009-12-25 23:44:28', `nome_fantasia` = 'Octa Tecnologia' WHERE `id` = 4
---
  def update
    @col = "col1"
    @cliente = Cliente.find(params[:id])
    if @cliente.update_attributes(params[:cliente])

SELECT * FROM `clientes` WHERE (`clientes`.`id` = 1)
DELETE FROM `clientes` WHERE `id` = 1
---
  def destroy
    @col = "col1"
    @cliente = Cliente.find(params[:id])
    @cliente.destroy