app/controllers/admin/estabelecimentos_controller.rb

SELECT * FROM `estabelecimentos`
---
  def index
    @col = "col2-right"
    @estabelecimentos = Estabelecimento.all

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 5)
SELECT * FROM `bares_e_boates` WHERE (`bares_e_boates`.`estabelecimento_id` = 5) LIMIT 1
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`estabelecimento_id` = 5) LIMIT 1
SELECT * FROM `hoteis_pousadas` WHERE (`hoteis_pousadas`.`estabelecimento_id` = 13) LIMIT 1
SELECT * FROM `tarifarios` WHERE (`tarifarios`.`estabelecimento_id` = 15) LIMIT 1
---
  def show
    @col = "col1"
    @estabelecimento = Estabelecimento.find(params[:id])
    @caso = @estabelecimento.tipo_estabelecimento
    @resultado = case @caso
      when "BECN"
        @caso = BaresEBoate.find_by_estabelecimento_id(@estabelecimento.id)
      when "REST"
        @caso = Restaurante.find_by_estabelecimento_id(@estabelecimento.id)
      when "IPLT"
        @caso = ImovelLocacao.find_by_estabelecimento_id(@estabelecimento.id)
      when "HEPO"
        @caso = HoteisPousada.find_by_estabelecimento_id(@estabelecimento.id)
        @tarifarios = Tarifario.find_all_by_estabelecimento_id(@estabelecimento.id)

INSERT INTO `estabelecimentos` (`tipo_estabelecimento`, `created_at`, `valor_estabelecimento`, `updated_at`) VALUES(NULL, '2009-12-26 21:29:49', 0, '2009-12-26 21:29:49')
---
  def create
    @estabelecimento = Estabelecimento.new(params[:estabelecimento])
    if @estabelecimento.save

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 5)
SELECT * FROM `bares_e_boates` WHERE (`bares_e_boates`.`estabelecimento_id` IS NULL) LIMIT 1
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`estabelecimento_id` = 5) LIMIT 1
SELECT * FROM `hoteis_pousadas` WHERE (`hoteis_pousadas`.`estabelecimento_id` = 15) LIMIT 1
SELECT * FROM `tarifarios` WHERE (`tarifarios`.`estabelecimento_id` = 15)
---
  def edit
    @col = "col1"
    @estabelecimento = Estabelecimento.find(params[:id])
      if @estabelecimento.tipo_estabelecimento == "BECN"
        @bares_e_boate = BaresEBoate.find_by_estabelecimento_id(@estabelecimento.id)
      elsif @estabelecimento.tipo_estabelecimento == "REST"
        @restaurante = Restaurante.find_by_estabelecimento_id(@estabelecimento.id)
      elsif @estabelecimento.tipo_estabelecimento == "IPLT"
        @imovel_locacao = ImovelLocacao.find_by_estabelecimento_id(@estabelecimento.id)
      elsif @estabelecimento.tipo_estabelecimento == "HEPO"
        @hoteis_pousada = HoteisPousada.find_by_estabelecimento_id(@estabelecimento.id)
        @tarifario = Tarifario.new
        @tarifarios = Tarifario.find_all_by_estabelecimento_id(@estabelecimento)

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 5)
UPDATE `estabelecimentos` SET `updated_at` = '2009-12-28 04:15:28', `nome_estabelecimento` = 'restaurante' WHERE `id` = 5
---
  def update
    @estabelecimento = Estabelecimento.find(params[:id])
    @estabelecimento.attributes = params[:estabelecimento]
    @restaurante.attributes = params[:restaurante]
    if @estabelecimento.update_attributes(params[:estabelecimento])

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 4)
DELETE FROM `estabelecimentos` WHERE `id` = 4
---
  def destroy
    @estabelecimento = Estabelecimento.find(params[:id])
    @estabelecimento.destroy