app/controllers/admin/fotos_controller.rb

SELECT * FROM `fotos`
---
  def index
    @foto = Foto.all

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 15)
---
  def new
    @col = "col1"
    @estabelecimento = Estabelecimento.find(params[:estabelecimento_id])

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 40)
INSERT INTO `fotos` (`imagem_file_size`, `created_at`, `imagem_file_name`, `updated_at`, `imagem_content_type`, `imagem_updated_at`, `estabelecimento_id`, `imagem_legenda`) VALUES(NULL, '2009-12-27 22:26:24', NULL, '2009-12-27 22:26:24', NULL, NULL, NULL, 'lorem ipsum')
---
  def create
    @col = "col1"
    @estabelecimento = Estabelecimento.find(params[:estabelecimento_id])
    @foto = @estabelecimento.foto.build(params[:foto])
    if @foto.save

SELECT * FROM `fotos` WHERE (`fotos`.`id` = 29)
DELETE FROM `fotos` WHERE `id` = 29
---
  def destroy
    @foto = Foto.find(params[:id])
    @foto.destroy