app/controllers/admin/hoteis_pousadas_controller.rb

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 13)
SELECT * FROM `tarifarios` WHERE (`tarifarios`.`estabelecimento_id` = 15)
---
  def new
    @col = "col1"
    @estabelecimento = Estabelecimento.find(params[:estabelecimento_id])
    @hoteis_pousada = @estabelecimento.hoteis_pousada.build
    @tarifario = Tarifario.new
    @tarifarios = Tarifario.find_all_by_estabelecimento_id(@estabelecimento)

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 15)
INSERT INTO `hoteis_pousadas` (`created_at`, `apresentacao`, `tipo_acomodacao`, `updated_at`, `estabelecimento_id`, `caracteristica_acomodacao`) VALUES('2009-12-27 21:25:00', 'O Confiance Batel é a mais nova opção de hotelaria em Curitiba. Ele foi projetado para surpreender até mesmo os clientes mais exigentes com seu estilo.\r\n\r\nCada espaço e detalhe foi preparado para proporcionar ao hóspede todo o conforto possível. O Confiance preza pelo bem estar de seus clientes – seja na cortesia do atendimento ou no requinte de cada ambiente. Sua estadia em Curitiba será memorável.\r\n\r\nO Confiance Batel oferece instalações totalmente antialérgicas e grande parte de sua estrutura é de granito. Para seu maior conforto os apartamentos possuem paredes térmicas e isolamento acústico.\r\n\r\nCom tudo isso à sua disposição, o Confiance Batel espera por sua chegada, para tornar ainda melhor sua passagem por Curitiba.', 'Apartamentos\r\n Apartamento Quíntuplo\r\n Apartamento Quádruplo\r\n Apartamento Triplo\r\n Apartamento Duplo Solteiro\r\n Apartamento Duplo Casal\r\n Apartamento Single\r\n\r\nSuíte\r\n Suíte (Single ou Duplo) \r\n\r\n', '2009-12-27 21:25:00', 15, ' ar condicionado \r\n cama box spring \r\n cofre \r\n conexão com internet \r\n frigobar \r\n isolamento acústico \r\n piso antialérgico \r\n secador de cabelo \r\n telefone \r\n TV \r\n TV a cabo \r\n\r\n')
---
  def create
    @estabelecimento = Estabelecimento.find(params[:estabelecimento_id])
    @hoteis_pousada = @estabelecimento.hoteis_pousada.build(params[:hoteis_pousada])
    @tarifario = Tarifario.new(params[:tarifario])
    if @hoteis_pousada.save

SELECT * FROM `hoteis_pousadas` WHERE (`hoteis_pousadas`.`id` = 1)
---
  def update
    @hoteis_pousada = HoteisPousada.find(params[:id])