app/controllers/admin/imovel_locacoes_controller.rb

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 7)
---
  def new
    @col = "col1"
    @estabelecimento = Estabelecimento.find(params[:estabelecimento_id])

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 7)
---
  def create
    @estabelecimento = Estabelecimento.find(params[:estabelecimento_id])