app/controllers/admin/restaurantes_controller.rb

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 5)
---
  def new
    @col = "col1"
    @estabelecimento = Estabelecimento.find(params[:estabelecimento_id])

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 5)
INSERT INTO `restaurantes` (`horario_atendimento`, `created_at`, `updated_at`, `forma_pagamento`, `cardapio`, `estabelecimento_id`, `descricao`) VALUES('Lorem ipsum\r\n', '2009-12-27 00:52:05', '2009-12-27 00:52:05', 'Lorem ipsum', 'Lorem ipsum', 5, 'Lorem ipsum')
---
  def create
    @estabelecimento = Estabelecimento.find(params[:estabelecimento_id])
    @restaurante = @estabelecimento.restaurante.build(params[:restaurante])
    if @restaurante.save

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 1)
UPDATE `restaurantes` SET `updated_at` = '2009-12-27 21:52:34', `descricao` = 'Lorem ipsum 2', `horario_atendimento` = 'Lorem ipsum 2\r\n', `forma_pagamento` = 'Lorem ipsum 2', `cardapio` = 'Lorem ipsum 2' WHERE `id` = 1
---
  def update
    @restaurante = Restaurante.find(params[:id])
    if @restaurante.update_attributes(params[:restaurante])