app/controllers/admin/tarifarios_controller.rb

INSERT INTO `tarifarios` (`valor_balcao`, `created_at`, `updated_at`, `iniciar_em`, `acomodacao`, `periodo`, `valor_internet`, `estabelecimento_id`, `terminar_em`) VALUES(NULL, '2009-12-27 18:55:57', '2009-12-27 18:55:57', '2009-12-27', '', '', NULL, 15, '2009-12-27')
---
  def create
    @tarifario = Tarifario.new(params[:tarifario])
    respond_to do |format|
      if @tarifario.save

SELECT * FROM `tarifarios` WHERE (`tarifarios`.`id` = 4)
DELETE FROM `tarifarios` WHERE `id` = 4
---
  def destroy
    @tarifario = Tarifario.find(params[:id])
    @tarifario.destroy