app/controllers/admin/users_controller.rb

SELECT * FROM `users` WHERE (username LIKE '%%' OR email LIKE '%%')
---
  def index
    @col = "col2-right"
    if params[:search]
      @users = User.search(params[:search])

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `role`, `password_salt`, `persistence_token`, `roles_mask`, `email`) VALUES('2009-12-28 02:51:56', 'a4b42fef90d156ddaaf2da6f49c709e04742648712b508c1ba3d94ca892868df2f09e05231589225e5d18b320ff739d169d1a8e5e3669f4a13c0b7a261e980a3', '2009-12-28 02:51:56', 'alberto', NULL, 'kWT7LQZCxDOQRXW-tMw6', 'b37ff50906c20d35869ea37c36fa7ea9c89aee1a56ae60e5188a7b415cbe88d81c45c83d89b0f9de9094e54b51854766d6ee4323c7483b17834eba82d7bcad75', NULL, 'octagonotecnologia@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def edit
    @col = "col2-right"
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
DELETE FROM `users` WHERE `id` = 2
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy