app/controllers/bares_e_boates_controller.rb

  def index
    @bares_e_boates = BaresEBoate.all
---
SELECT * FROM `bares_e_boates`

  def show
    @bares_e_boate = BaresEBoate.find(params[:id])
---
SELECT * FROM `bares_e_boates` WHERE (`bares_e_boates`.`id` = 1)

  def create
    @bares_e_boate = BaresEBoate.new(params[:bares_e_boate])
    if @bares_e_boate.save
---
INSERT INTO `bares_e_boates` (`publico_alvo`, `horario_atendimento`, `created_at`, `updated_at`, `forma_pagamento`, `nome_estabelecimento`, `estabelecimento_id`, `descricao`) VALUES('lorem ipsum', 'lorem ipsum', '2009-12-26 23:10:15', '2009-12-26 23:10:15', 'lorem ipsum', NULL, NULL, 'lorem ipsum')