app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT * FROM `clientes`

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT * FROM `clientes` WHERE (`clientes`.`id` = 1)

  def create
    @cliente = Cliente.new(params[:cliente])
    if @cliente.save
---
INSERT INTO `clientes` (`email_responsavel`, `telefone_comercial`, `created_at`, `cep_estabelecimento`, `estado_estabelecimento`, `updated_at`, `cnpj_estabelecimento`, `telefone_responsavel`, `cidade_estabelecimento`, `ramo_atuacao`, `bairro_estabelecimento`, `email_estabelecimento`, `razao_social`, `endereco_estabelecimento`, `numero_estabelecimento`, `complemento_estabelecimento`, `telefone_fax`, `nome_responsavel`, `telefone_celular`, `nome_fantasia`) VALUES('', NULL, '2009-12-25 23:14:51', NULL, '', '2009-12-25 23:14:51', NULL, NULL, '', '', '', '', '', '', NULL, '', NULL, '', NULL, '')

  def destroy
    @cliente = Cliente.find(params[:id])
    @cliente.destroy
---
SELECT * FROM `clientes` WHERE (`clientes`.`id` = 1)
DELETE FROM `clientes` WHERE `id` = 1