app/controllers/estabelecimentos_controller.rb

SELECT * FROM `estabelecimentos` WHERE (`estabelecimentos`.`id` = 5)
---
  def show
    @estabelecimento = Estabelecimento.find(params[:id])