app/controllers/hoteis_pousadas_controller.rb

  def show
    @hoteis_pousada = HoteisPousada.find(params[:id])
---
SELECT * FROM `hoteis_pousadas` WHERE (`hoteis_pousadas`.`id` = 1)