app/controllers/tarifarios_controller.rb

SELECT * FROM `tarifarios` WHERE (`tarifarios`.`id` = 1)
---
  def show
    @tarifario = Tarifario.find(params[:id])