app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `role`, `password_salt`, `persistence_token`, `roles_mask`, `email`) VALUES('2009-12-23 02:10:13', 'ac8d394e0dd0918e39269f0e33cfdd5aafd174fe3f6861ff4102fe3aa8ca9e5701d370896e83f08d09497e99f20ca9c243358f093812017d4d62623cceb0b310', '2009-12-23 02:10:13', 'alberto.braschi', NULL, '3aDSpYLGe21D9gR15ZQS', '65725d9fad55ef6665c106fb7df3dbaaf1419894cd94f189bd4fd492dddff311dcf0afb9e763857442e013738dd4ee6277989e987598187cee89ac2360df000b', 1, 'alberto.braschi@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save